app/Models/Accounting/SharesAccountModel.php

SELECT SUM(`shares_owned`) AS `total_shares`
FROM `share_accounts`
---
    public function getTotalShares()
    {
        $db = \Config\Database::connect();

        // Sum shares for all members
        $totals = $db->table('share_accounts')
            ->selectSum('shares_owned', 'total_shares')
            ->get()
            ->getRow();