app/Models/Accounting/TransactionsModel.php

SELECT SUM(`amount`) AS `amount`
FROM `transactions`
WHERE `service_transaction` = 'savings'
AND  `transaction_date` LIKE '2025-01%' ESCAPE '!'
---
    public function getMonthlyTotal(string $type, string $yearMonth, ?string $memberNo = null): float
    {
        $builder = $this->selectSum('amount')
            ->where('service_transaction', $type)
            ->like('transaction_date', $yearMonth, 'after');

        if ($memberNo) {
            $builder->where('member_number', $memberNo);
        }

        $result = $builder->get()->getRow();