app/Controllers/Auth.php

            $password = $this->request->getPost('password');

            $userModel = new UserModel();
            $user = $userModel->where('name', $name)->first();
---
SELECT *
FROM `user`
WHERE `name` = 'Jack'
 LIMIT 1