app/Controllers/BankController.php

SELECT *
FROM `tbl_bank`
WHERE `paymentDate` = '2020-08-28T17:32:02.7460598+03:00'
 LIMIT 1
---

        // Check for duplicate transaction
        $bankModel = new BankModel();
        $exists = $bankModel->where('paymentDate', $request['PaymentDate'])->first();

SELECT *
FROM `members`
WHERE `member_number` = '001'
 LIMIT 1
---

        // Check member existence
        $memberModel = new \App\Models\MembersModel();
        $member = $memberModel->where('member_number', $referenceCode)->first();