app/Controllers/Dashboard.php

SELECT *
FROM `user`
WHERE `user`.`id` = '1'
---
    public function index()
    {

        $paymentsModel = new PaymentsModel();
        $memberModel = new MembersModel();
        $savingsModel = new SavingsAccountModel();
        $sharesModel = new SharesAccountModel();
        $loanModel = new LoanApplicationModel();
        $repaymentModel = new LoanRepaymentModel();
        $transactionsModel = new TransactionsModel();
        $staffModel = new StaffModel();

        $userModel = new UserModel();
        $loggedInUserId = session()->get('loggedInUser');
        $userInfo = $userModel->find($loggedInUserId);