app/Controllers/Members.php

SELECT *
FROM `user`
WHERE `user`.`id` = '1'
SELECT *
FROM `members`
---
    public function index()
    {
        $model = model(MembersModel::class);
        $userModel = new UserModel();
        $loggedInUserId = session()->get('loggedInUser');
        $userInfo = $userModel->find($loggedInUserId);

        $data = [
            'members' => $model->findAll(),
            'title' => 'Members',
            'userInfo' => $userInfo,
        ];