app/Models/LoanApplicationModel.php

SELECT SUM(`disburse_amount`) AS `disburse_amount`
FROM `loan_applications`
WHERE `loan_status` = 'approved'
---
    public function getTotalLoans()
    {
        $db = \Config\Database::connect();

        $total = $db->table('loan_applications')
            ->selectSum('disburse_amount')
            ->where('loan_status', 'approved')
            ->get()
            ->getRow();