app/Models/MembersModel.php

SELECT COUNT(*) AS `numrows`
FROM `members`
WHERE `is_active` = 1
---
    public function getActiveMembers()
    {
        $db = \Config\Database::connect();

        // Count active members
        $activeMembers = $db->table($this->table)
            ->where('is_active', 1)
            ->countAllResults();